simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "SYNC_IN_aliases.h"
#include "SYNC_IN.h"
#include "Timer.h"
#include "isr_Timer.h"
#include "isr_SyncIn.h"
#include "UART.h"
#include "LPp_aliases.h"
#include "LPp.h"
#include "LPo_aliases.h"
#include "LPo.h"
#include "LPm_aliases.h"
#include "LPm.h"
#include "Opa_LP.h"
#include "LPF_ADC.h"
#include "ADC.h"
#include "LPF_ref.h"
#include "Opa_ref.h"
#include "PGA_ref.h"
#include "PGAo_aliases.h"
#include "PGAo.h"
#include "Vref_aliases.h"
#include "Vref.h"
#include "PGA.h"
#include "VDAC.h"
#include "PGAin_aliases.h"
#include "PGAin.h"
#include "isr_DelSig.h"
#include "UART_IntClock.h"
#include "ADC_AMux.h"
#include "ADC_Ext_CP_Clk.h"
#include "ADC_Bypass_P03_aliases.h"
#include "ADC_Bypass_P03.h"
#include "ADC_IRQ.h"
#include "ADC_theACLK.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

